zephyrproject-rtos/hal_microchip/sam/sam_d5x_e5x/atsame53/include/component/sdhc.h
/* -------- SDHC_MC2R : (SDHC Offset: 0x205) ( /W 8) MMC Control 2 -------- */
#define SDHC_MC2R_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_MC2R) MMC Control 2  Reset Value */

#define SDHC_MC2R_SRESP_Pos                   _UINT8_(0)                                           /* (SDHC_MC2R) e.MMC Abort Wait IRQ Position */
#define SDHC_MC2R_SRESP_Msk                   (_UINT8_(0x1) << SDHC_MC2R_SRESP_Pos)                /* (SDHC_MC2R) e.MMC Abort Wait IRQ Mask */
#define SDHC_MC2R_SRESP(value)                (SDHC_MC2R_SRESP_Msk & (_UINT8_(value) << SDHC_MC2R_SRESP_Pos)) /* Assignment of value for SRESP in the SDHC_MC2R register */
#define SDHC_MC2R_ABOOT_Pos                   _UINT8_(1)                                           /* (SDHC_MC2R) e.MMC Abort Boot Position */
#define SDHC_MC2R_ABOOT_Msk                   (_UINT8_(0x1) << SDHC_MC2R_ABOOT_Pos)                /* (SDHC_MC2R) e.MMC Abort Boot Mask */
#define SDHC_MC2R_ABOOT(value)                (SDHC_MC2R_ABOOT_Msk & (_UINT8_(value) << SDHC_MC2R_ABOOT_Pos)) /* Assignment of value for ABOOT in the SDHC_MC2R register */
#define SDHC_MC2R_Msk                         _UINT8_(0x03)                                        /* (SDHC_MC2R) Register Mask  */


/* -------- SDHC_ACR : (SDHC Offset: 0x208) (R/W 32) AHB Control -------- */
#define SDHC_ACR_RESETVALUE                   _UINT32_(0x00)                                       /*  (SDHC_ACR) AHB Control  Reset Value */

#define SDHC_ACR_BMAX_Pos                     _UINT32_(0)                                          /* (SDHC_ACR) AHB Maximum Burst Position */
#define SDHC_ACR_BMAX_Msk                     (_UINT32_(0x3) << SDHC_ACR_BMAX_Pos)                 /* (SDHC_ACR) AHB Maximum Burst Mask */
#define SDHC_ACR_BMAX(value)                  (SDHC_ACR_BMAX_Msk & (_UINT32_(value) << SDHC_ACR_BMAX_Pos)) /* Assignment of value for BMAX in the SDHC_ACR register */
#define   SDHC_ACR_BMAX_INCR16_Val            _UINT32_(0x0)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR8_Val             _UINT32_(0x1)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR4_Val             _UINT32_(0x2)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_SINGLE_Val            _UINT32_(0x3)                                        /* (SDHC_ACR)   */
#define SDHC_ACR_BMAX_INCR16                  (SDHC_ACR_BMAX_INCR16_Val << SDHC_ACR_BMAX_Pos)      /* (SDHC_ACR)  Position */
#define SDHC_ACR_BMAX_INCR8                   (SDHC_ACR_BMAX_INCR8_Val << SDHC_ACR_BMAX_Pos)       /* (SDHC_ACR)  Position */
#define SDHC_ACR_BMAX_INCR4                   (SDHC_ACR_BMAX_INCR4_Val << SDHC_ACR_BMAX_Pos)       /* (SDHC_ACR)  Position */
#define SDHC_ACR_BMAX_SINGLE                  (SDHC_ACR_BMAX_SINGLE_Val << SDHC_ACR_BMAX_Pos)      /* (SDHC_ACR)  Position */
#define SDHC_ACR_Msk                          _UINT32_(0x00000003)                                 /* (SDHC_ACR) Register Mask  */


/* -------- SDHC_CC2R : (SDHC Offset: 0x20C) (R/W 32) Clock Control 2 -------- */
#define SDHC_CC2R_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_CC2R) Clock Control 2  Reset Value */

#define SDHC_CC2R_FSDCLKD_Pos                 _UINT32_(0)                                          /* (SDHC_CC2R) Force SDCK Disabled Position */
#define SDHC_CC2R_FSDCLKD_Msk                 (_UINT32_(0x1) << SDHC_CC2R_FSDCLKD_Pos)             /* (SDHC_CC2R) Force SDCK Disabled Mask */
#define SDHC_CC2R_FSDCLKD(value)              (SDHC_CC2R_FSDCLKD_Msk & (_UINT32_(value) << SDHC_CC2R_FSDCLKD_Pos)) /* Assignment of value for FSDCLKD in the SDHC_CC2R register */
#define   SDHC_CC2R_FSDCLKD_NOEFFECT_Val      _UINT32_(0x0)                                        /* (SDHC_CC2R) No effect  */
#define   SDHC_CC2R_FSDCLKD_DISABLE_Val       _UINT32_(0x1)                                        /* (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled  */
#define SDHC_CC2R_FSDCLKD_NOEFFECT            (SDHC_CC2R_FSDCLKD_NOEFFECT_Val << SDHC_CC2R_FSDCLKD_Pos) /* (SDHC_CC2R) No effect Position */
#define SDHC_CC2R_FSDCLKD_DISABLE             (SDHC_CC2R_FSDCLKD_DISABLE_Val << SDHC_CC2R_FSDCLKD_Pos) /* (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled Position */
#define SDHC_CC2R_Msk                         _UINT32_(0x00000001)                                 /* (SDHC_CC2R) Register Mask  */


/* -------- SDHC_CACR : (SDHC Offset: 0x230) (R/W 32) Capabilities Control -------- */
#define SDHC_CACR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_CACR) Capabilities Control  Reset Value */

#define SDHC_CACR_CAPWREN_Pos                 _UINT32_(0)                                          /* (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Position */
#define SDHC_CACR_CAPWREN_Msk                 (_UINT32_(0x1) << SDHC_CACR_CAPWREN_Pos)             /* (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Mask */
#define SDHC_CACR_CAPWREN(value)              (SDHC_CACR_CAPWREN_Msk & (_UINT32_(value) << SDHC_CACR_CAPWREN_Pos)) /* Assignment of value for CAPWREN in the SDHC_CACR register */
#define SDHC_CACR_KEY_Pos                     _UINT32_(8)                                          /* (SDHC_CACR) Key (0x46) Position */
#define SDHC_CACR_KEY_Msk                     (_UINT32_(0xFF) << SDHC_CACR_KEY_Pos)                /* (SDHC_CACR) Key (0x46) Mask */
#define SDHC_CACR_KEY(value)                  (SDHC_CACR_KEY_Msk & (_UINT32_(value) << SDHC_CACR_KEY_Pos)) /* Assignment of value for KEY in the SDHC_CACR register */
#define   SDHC_CACR_KEY_KEY_Val               _UINT32_(0x46)                                       /* (SDHC_CACR) Key  */
#define SDHC_CACR_KEY_KEY                     (SDHC_CACR_KEY_KEY_Val << SDHC_CACR_KEY_Pos)         /* (SDHC_CACR) Key Position */
#define SDHC_CACR_Msk                         _UINT32_(0x0000FF01)                                 /* (SDHC_CACR) Register Mask  */


/* -------- SDHC_DBGR : (SDHC Offset: 0x234) (R/W 8) Debug -------- */
#define SDHC_DBGR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_DBGR) Debug  Reset Value */

#define SDHC_DBGR_NIDBG_Pos                   _UINT8_(0)                                           /* (SDHC_DBGR) Non-intrusive debug enable Position */
#define SDHC_DBGR_NIDBG_Msk                   (_UINT8_(0x1) << SDHC_DBGR_NIDBG_Pos)                /* (SDHC_DBGR) Non-intrusive debug enable Mask */
#define SDHC_DBGR_NIDBG(value)                (SDHC_DBGR_NIDBG_Msk & (_UINT8_(value) << SDHC_DBGR_NIDBG_Pos)) /* Assignment of value for NIDBG in the SDHC_DBGR register */
#define   SDHC_DBGR_NIDBG_IDBG_Val            _UINT8_(0x0)                                         /* (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)  */
#define   SDHC_DBGR_NIDBG_NIDBG_Val           _UINT8_(0x1)                                         /* (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)  */
#define SDHC_DBGR_NIDBG_IDBG                  (SDHC_DBGR_NIDBG_IDBG_Val << SDHC_DBGR_NIDBG_Pos)    /* (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer) Position */
#define SDHC_DBGR_NIDBG_NIDBG                 (SDHC_DBGR_NIDBG_NIDBG_Val << SDHC_DBGR_NIDBG_Pos)   /* (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer) Position */
#define SDHC_DBGR_Msk                         _UINT8_(0x01)                                        /* (SDHC_DBGR) Register Mask  */


