zephyrproject-rtos/hal_microchip/sam/sam_d5x_e5x/atsame53/include/component/sdhc.h
/* SDHC register offsets definitions */
#define SDHC_SSAR_REG_OFST             _UINT32_(0x00)      /* (SDHC_SSAR) SDMA System Address / Argument 2 Offset */
#define SDHC_BSR_REG_OFST              _UINT32_(0x04)      /* (SDHC_BSR) Block Size Offset */
#define SDHC_BCR_REG_OFST              _UINT32_(0x06)      /* (SDHC_BCR) Block Count Offset */
#define SDHC_ARG1R_REG_OFST            _UINT32_(0x08)      /* (SDHC_ARG1R) Argument 1 Offset */
#define SDHC_TMR_REG_OFST              _UINT32_(0x0C)      /* (SDHC_TMR) Transfer Mode Offset */
#define SDHC_CR_REG_OFST               _UINT32_(0x0E)      /* (SDHC_CR) Command Offset */
#define SDHC_RR_REG_OFST               _UINT32_(0x10)      /* (SDHC_RR) Response Offset */
#define SDHC_RR0_REG_OFST              _UINT32_(0x10)      /* (SDHC_RR0) Response Offset */
#define SDHC_RR1_REG_OFST              _UINT32_(0x14)      /* (SDHC_RR1) Response Offset */
#define SDHC_RR2_REG_OFST              _UINT32_(0x18)      /* (SDHC_RR2) Response Offset */
#define SDHC_RR3_REG_OFST              _UINT32_(0x1C)      /* (SDHC_RR3) Response Offset */
#define SDHC_BDPR_REG_OFST             _UINT32_(0x20)      /* (SDHC_BDPR) Buffer Data Port Offset */
#define SDHC_PSR_REG_OFST              _UINT32_(0x24)      /* (SDHC_PSR) Present State Offset */
#define SDHC_HC1R_REG_OFST             _UINT32_(0x28)      /* (SDHC_HC1R) Host Control 1 Offset */
#define SDHC_PCR_REG_OFST              _UINT32_(0x29)      /* (SDHC_PCR) Power Control Offset */
#define SDHC_BGCR_REG_OFST             _UINT32_(0x2A)      /* (SDHC_BGCR) Block Gap Control Offset */
#define SDHC_WCR_REG_OFST              _UINT32_(0x2B)      /* (SDHC_WCR) Wakeup Control Offset */
#define SDHC_CCR_REG_OFST              _UINT32_(0x2C)      /* (SDHC_CCR) Clock Control Offset */
#define SDHC_TCR_REG_OFST              _UINT32_(0x2E)      /* (SDHC_TCR) Timeout Control Offset */
#define SDHC_SRR_REG_OFST              _UINT32_(0x2F)      /* (SDHC_SRR) Software Reset Offset */
#define SDHC_NISTR_REG_OFST            _UINT32_(0x30)      /* (SDHC_NISTR) Normal Interrupt Status Offset */
#define SDHC_EISTR_REG_OFST            _UINT32_(0x32)      /* (SDHC_EISTR) Error Interrupt Status Offset */
#define SDHC_NISTER_REG_OFST           _UINT32_(0x34)      /* (SDHC_NISTER) Normal Interrupt Status Enable Offset */
#define SDHC_EISTER_REG_OFST           _UINT32_(0x36)      /* (SDHC_EISTER) Error Interrupt Status Enable Offset */
#define SDHC_NISIER_REG_OFST           _UINT32_(0x38)      /* (SDHC_NISIER) Normal Interrupt Signal Enable Offset */
#define SDHC_EISIER_REG_OFST           _UINT32_(0x3A)      /* (SDHC_EISIER) Error Interrupt Signal Enable Offset */
#define SDHC_ACESR_REG_OFST            _UINT32_(0x3C)      /* (SDHC_ACESR) Auto CMD Error Status Offset */
#define SDHC_HC2R_REG_OFST             _UINT32_(0x3E)      /* (SDHC_HC2R) Host Control 2 Offset */
#define SDHC_CA0R_REG_OFST             _UINT32_(0x40)      /* (SDHC_CA0R) Capabilities 0 Offset */
#define SDHC_CA1R_REG_OFST             _UINT32_(0x44)      /* (SDHC_CA1R) Capabilities 1 Offset */
#define SDHC_MCCAR_REG_OFST            _UINT32_(0x48)      /* (SDHC_MCCAR) Maximum Current Capabilities Offset */
#define SDHC_FERACES_REG_OFST          _UINT32_(0x50)      /* (SDHC_FERACES) Force Event for Auto CMD Error Status Offset */
#define SDHC_FEREIS_REG_OFST           _UINT32_(0x52)      /* (SDHC_FEREIS) Force Event for Error Interrupt Status Offset */
#define SDHC_AESR_REG_OFST             _UINT32_(0x54)      /* (SDHC_AESR) ADMA Error Status Offset */
#define SDHC_ASAR_REG_OFST             _UINT32_(0x58)      /* (SDHC_ASAR) ADMA System Address Offset */
#define SDHC_ASAR0_REG_OFST            _UINT32_(0x58)      /* (SDHC_ASAR0) ADMA System Address Offset */
#define SDHC_PVR_REG_OFST              _UINT32_(0x60)      /* (SDHC_PVR) Preset Value n Offset */
#define SDHC_PVR0_REG_OFST             _UINT32_(0x60)      /* (SDHC_PVR0) Preset Value n Offset */
#define SDHC_PVR1_REG_OFST             _UINT32_(0x62)      /* (SDHC_PVR1) Preset Value n Offset */
#define SDHC_PVR2_REG_OFST             _UINT32_(0x64)      /* (SDHC_PVR2) Preset Value n Offset */
#define SDHC_PVR3_REG_OFST             _UINT32_(0x66)      /* (SDHC_PVR3) Preset Value n Offset */
#define SDHC_PVR4_REG_OFST             _UINT32_(0x68)      /* (SDHC_PVR4) Preset Value n Offset */
#define SDHC_PVR5_REG_OFST             _UINT32_(0x6A)      /* (SDHC_PVR5) Preset Value n Offset */
#define SDHC_PVR6_REG_OFST             _UINT32_(0x6C)      /* (SDHC_PVR6) Preset Value n Offset */
#define SDHC_PVR7_REG_OFST             _UINT32_(0x6E)      /* (SDHC_PVR7) Preset Value n Offset */
#define SDHC_SISR_REG_OFST             _UINT32_(0xFC)      /* (SDHC_SISR) Slot Interrupt Status Offset */
#define SDHC_HCVR_REG_OFST             _UINT32_(0xFE)      /* (SDHC_HCVR) Host Controller Version Offset */
#define SDHC_APSR_REG_OFST             _UINT32_(0x200)     /* (SDHC_APSR) Additional Present State Register Offset */
#define SDHC_MC1R_REG_OFST             _UINT32_(0x204)     /* (SDHC_MC1R) MMC Control 1 Offset */
#define SDHC_MC2R_REG_OFST             _UINT32_(0x205)     /* (SDHC_MC2R) MMC Control 2 Offset */
#define SDHC_ACR_REG_OFST              _UINT32_(0x208)     /* (SDHC_ACR) AHB Control Offset */
#define SDHC_CC2R_REG_OFST             _UINT32_(0x20C)     /* (SDHC_CC2R) Clock Control 2 Offset */
#define SDHC_CACR_REG_OFST             _UINT32_(0x230)     /* (SDHC_CACR) Capabilities Control Offset */
#define SDHC_DBGR_REG_OFST             _UINT32_(0x234)     /* (SDHC_DBGR) Debug Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* SDHC register API structure */
typedef struct
{  /* SD/MMC Host Controller */
  __IO  uint32_t                       SDHC_SSAR;          /* Offset: 0x00 (R/W  32) SDMA System Address / Argument 2 */
  __IO  uint16_t                       SDHC_BSR;           /* Offset: 0x04 (R/W  16) Block Size */
  __IO  uint16_t                       SDHC_BCR;           /* Offset: 0x06 (R/W  16) Block Count */
  __IO  uint32_t                       SDHC_ARG1R;         /* Offset: 0x08 (R/W  32) Argument 1 */
  __IO  uint16_t                       SDHC_TMR;           /* Offset: 0x0C (R/W  16) Transfer Mode */
  __IO  uint16_t                       SDHC_CR;            /* Offset: 0x0E (R/W  16) Command */
  __I   uint32_t                       SDHC_RR[4];         /* Offset: 0x10 (R/   32) Response */
  __IO  uint32_t                       SDHC_BDPR;          /* Offset: 0x20 (R/W  32) Buffer Data Port */
  __I   uint32_t                       SDHC_PSR;           /* Offset: 0x24 (R/   32) Present State */
  __IO  uint8_t                        SDHC_HC1R;          /* Offset: 0x28 (R/W  8) Host Control 1 */
  __IO  uint8_t                        SDHC_PCR;           /* Offset: 0x29 (R/W  8) Power Control */
  __IO  uint8_t                        SDHC_BGCR;          /* Offset: 0x2A (R/W  8) Block Gap Control */
  __IO  uint8_t                        SDHC_WCR;           /* Offset: 0x2B (R/W  8) Wakeup Control */
  __IO  uint16_t                       SDHC_CCR;           /* Offset: 0x2C (R/W  16) Clock Control */
  __IO  uint8_t                        SDHC_TCR;           /* Offset: 0x2E (R/W  8) Timeout Control */
  __IO  uint8_t                        SDHC_SRR;           /* Offset: 0x2F (R/W  8) Software Reset */
  __IO  uint16_t                       SDHC_NISTR;         /* Offset: 0x30 (R/W  16) Normal Interrupt Status */
  __IO  uint16_t                       SDHC_EISTR;         /* Offset: 0x32 (R/W  16) Error Interrupt Status */
  __IO  uint16_t                       SDHC_NISTER;        /* Offset: 0x34 (R/W  16) Normal Interrupt Status Enable */
  __IO  uint16_t                       SDHC_EISTER;        /* Offset: 0x36 (R/W  16) Error Interrupt Status Enable */
  __IO  uint16_t                       SDHC_NISIER;        /* Offset: 0x38 (R/W  16) Normal Interrupt Signal Enable */
  __IO  uint16_t                       SDHC_EISIER;        /* Offset: 0x3A (R/W  16) Error Interrupt Signal Enable */
  __I   uint16_t                       SDHC_ACESR;         /* Offset: 0x3C (R/   16) Auto CMD Error Status */
  __IO  uint16_t                       SDHC_HC2R;          /* Offset: 0x3E (R/W  16) Host Control 2 */
  __I   uint32_t                       SDHC_CA0R;          /* Offset: 0x40 (R/   32) Capabilities 0 */
  __I   uint32_t                       SDHC_CA1R;          /* Offset: 0x44 (R/   32) Capabilities 1 */
  __I   uint32_t                       SDHC_MCCAR;         /* Offset: 0x48 (R/   32) Maximum Current Capabilities */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint16_t                       SDHC_FERACES;       /* Offset: 0x50 ( /W  16) Force Event for Auto CMD Error Status */
  __O   uint16_t                       SDHC_FEREIS;        /* Offset: 0x52 ( /W  16) Force Event for Error Interrupt Status */
  __I   uint8_t                        SDHC_AESR;          /* Offset: 0x54 (R/   8) ADMA Error Status */
  __I   uint8_t                        Reserved2[0x03];
  __IO  uint32_t                       SDHC_ASAR[1];       /* Offset: 0x58 (R/W  32) ADMA System Address */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint16_t                       SDHC_PVR[8];        /* Offset: 0x60 (R/W  16) Preset Value n */
  __I   uint8_t                        Reserved4[0x8C];
  __I   uint16_t                       SDHC_SISR;          /* Offset: 0xFC (R/   16) Slot Interrupt Status */
  __I   uint16_t                       SDHC_HCVR;          /* Offset: 0xFE (R/   16) Host Controller Version */
  __I   uint8_t                        Reserved5[0x100];
  __I   uint32_t                       SDHC_APSR;          /* Offset: 0x200 (R/   32) Additional Present State Register */
  __IO  uint8_t                        SDHC_MC1R;          /* Offset: 0x204 (R/W  8) MMC Control 1 */
  __O   uint8_t                        SDHC_MC2R;          /* Offset: 0x205 ( /W  8) MMC Control 2 */
  __I   uint8_t                        Reserved6[0x02];
  __IO  uint32_t                       SDHC_ACR;           /* Offset: 0x208 (R/W  32) AHB Control */
  __IO  uint32_t                       SDHC_CC2R;          /* Offset: 0x20C (R/W  32) Clock Control 2 */
  __I   uint8_t                        Reserved7[0x20];
  __IO  uint32_t                       SDHC_CACR;          /* Offset: 0x230 (R/W  32) Capabilities Control */
  __IO  uint8_t                        SDHC_DBGR;          /* Offset: 0x234 (R/W  8) Debug */
} sdhc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAME53_SDHC_COMPONENT_H_ */
